AndresRuzTeran/OrionBelt/versions/v4_web_esp32/firmware/CameraWebServer/app_httpd.cpp
  httpd_uri_t win_uri = {
    .uri = "/resolution",
    .method = HTTP_GET,
    .handler = win_handler,
    .user_ctx = NULL
#ifdef CONFIG_HTTPD_WS_SUPPORT
    ,
    .is_websocket = true,
    .handle_ws_control_frames = false,
    .supported_subprotocol = NULL
#endif
  };

  ra_filter_init(&ra_filter, 20);

  log_i("Starting web server on port: '%d'", config.server_port);
  if (httpd_start(&camera_httpd, &config) == ESP_OK) {
    httpd_register_uri_handler(camera_httpd, &index_uri);
    httpd_register_uri_handler(camera_httpd, &cmd_uri);
    httpd_register_uri_handler(camera_httpd, &status_uri);
    httpd_register_uri_handler(camera_httpd, &capture_uri);
    httpd_register_uri_handler(camera_httpd, &bmp_uri);

    httpd_register_uri_handler(camera_httpd, &xclk_uri);
    httpd_register_uri_handler(camera_httpd, &reg_uri);
    httpd_register_uri_handler(camera_httpd, &greg_uri);
    httpd_register_uri_handler(camera_httpd, &pll_uri);
    httpd_register_uri_handler(camera_httpd, &win_uri);
#if defined(LED_GPIO_NUM)
    httpd_register_uri_handler(camera_httpd, &led_uri);
#endif
    httpd_register_uri_handler(camera_httpd, &buzzer_uri);
  }

  config.server_port += 1;
  config.ctrl_port += 1;
  log_i("Starting stream server on port: '%d'", config.server_port);
  if (httpd_start(&stream_httpd, &config) == ESP_OK) {
    httpd_register_uri_handler(stream_httpd, &stream_uri);
  }
}

void setupLedFlash() {
  const int frecuencia = 5000;
  const int resolucion = 8; // bits

  ledcAttach(LED_GPIO_NUM, frecuencia, resolucion);
}

void setupBuzzer() {
  const int frecuencia = 2000;      // Frecuencia del buzzer (2kHz)
  const int resolucion = 8;         // bits

  ledcAttach(BUZZER_GPIO_NUM, frecuencia, resolucion);
  buzzer_duty = 128;  // Duty cycle por defecto
}

// Minimal raw TCP socket streaming server
// Protocol: for cada frame JPEG, se envía uint32_t (big-endian) con el tamaño, seguido del buffer JPEG
// Puerto sugerido: 3333
class RawSocketServer {
public:
  WiFiServer server;
  RawSocketServer(uint16_t port) : server(port) {}

  void begin() { server.begin(); }

  void handle() {
    WiFiClient client = server.accept();
    if (!client) return;
    client.setNoDelay(true);
    while (client.connected()) {
      camera_fb_t *fb = esp_camera_fb_get();
      if (!fb) {
        log_e("Camera capture failed");
        break;
      }
      uint8_t *jpg_buf = fb->buf;
      size_t jpg_len = fb->len;
      if (fb->format != PIXFORMAT_JPEG) {
        uint8_t *out = NULL; size_t out_len = 0;
        if (frame2jpg(fb, 80, &out, &out_len)) {
          esp_camera_fb_return(fb);
          fb = NULL; jpg_buf = out; jpg_len = out_len;
        }
      }
      // Send 4-byte length (big-endian)
      uint8_t hdr[4];
      hdr[0] = (jpg_len >> 24) & 0xFF;
      hdr[1] = (jpg_len >> 16) & 0xFF;
      hdr[2] = (jpg_len >> 8) & 0xFF;
      hdr[3] = (jpg_len) & 0xFF;
      if (client.write(hdr, 4) != 4) { if (fb) esp_camera_fb_return(fb); break; }
      size_t written = 0;
      while (written < jpg_len) {
        size_t chunk = client.write(jpg_buf + written, min((size_t)1460, jpg_len - written));
        if (!chunk) { break; }
        written += chunk;
      }
      if (fb) esp_camera_fb_return(fb);
      if (written < jpg_len) { break; }
      // Yield a bit
      vTaskDelay(1);
    }
    client.stop();
  }
};

static RawSocketServer *rawSocketServer = nullptr;

void startRawSocketStreamServer(uint16_t port) {
  if (rawSocketServer) return;
  rawSocketServer = new RawSocketServer(port);
  rawSocketServer->begin();
  log_i("Raw socket stream server started on %u", port);
}

// Call periodically from loop()
void handleRawSocketServer() {
  if (rawSocketServer) rawSocketServer->handle();
}

